zevorn/qemu/hw/gpio/stm32g474_gpio.c
/*
 * STM32G474 general-purpose I/O ports
 *
 * Copyright (c) 2026 Process Mission
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-clock.h"
#include "hw/gpio/stm32g474_gpio.h"
#include "hw/core/registerfields.h"
#include "migration/vmstate.h"
#include "qemu/log.h"
#include "qemu/module.h"

REG32(MODER, 0x00)
REG32(OTYPER, 0x04)
    FIELD(OTYPER, OT, 0, 16)
REG32(OSPEEDR, 0x08)
REG32(PUPDR, 0x0c)
REG32(IDR, 0x10)
    FIELD(IDR, ID, 0, 16)
REG32(ODR, 0x14)
    FIELD(ODR, OD, 0, 16)
REG32(BSRR, 0x18)
    FIELD(BSRR, BS, 0, 16)
    FIELD(BSRR, BR, 16, 16)
REG32(LCKR, 0x1c)
    FIELD(LCKR, LCK, 0, 16)
    FIELD(LCKR, LCKK, 16, 1)
REG32(AFRL, 0x20)
REG32(AFRH, 0x24)
REG32(BRR, 0x28)
    FIELD(BRR, BR, 0, 16)

#define STM32G474_GPIO_PIN_MASK UINT16_MAX

enum Stm32g474GpioLockPhase {
    STM32G474_GPIO_LOCK_IDLE,
    STM32G474_GPIO_LOCK_HAVE_KEY1,
    STM32G474_GPIO_LOCK_HAVE_KEY0,
    STM32G474_GPIO_LOCK_ARMED_FOR_READ,
    STM32G474_GPIO_LOCK_LOCKED,
    STM32G474_GPIO_LOCK_PHASE_COUNT,
};

struct Stm32g474GpioVariant {
    const char *name;
    const RegisterAccessInfo *regs_info;
    size_t num_regs;
};

static const Stm32g474GpioVariant *
stm32g474_gpio_get_variant(Stm32g474GpioState *s)
{
    return STM32G474_GPIO_GET_CLASS(s)->variant;
}

static bool stm32g474_gpio_in_reset(Stm32g474GpioState *s)
{
    return s->resetting || s->peripheral_reset_asserted;
}

static uint32_t stm32g474_gpio_access_mask(Stm32g474GpioState *s)
{
    unsigned int shift = 8 * s->current_access_lane;

    if (!s->current_access_size) {
        return 0;
    }

    return MAKE_64BIT_MASK(shift, 8 * s->current_access_size);
}

static uint32_t stm32g474_gpio_resolved_value(Stm32g474GpioState *s)
{
    uint32_t moder = s->regs[R_MODER];
    uint32_t otyper = s->regs[R_OTYPER];
    uint32_t pupdr = s->regs[R_PUPDR];
    uint32_t odr = s->regs[R_ODR];
    uint32_t resolved = 0;

    for (unsigned int pin = 0; pin < STM32G474_GPIO_NUM_PINS; pin++) {
        uint32_t bit = BIT(pin);
        unsigned int mode = extract32(moder, 2 * pin, 2);
        unsigned int pull = extract32(pupdr, 2 * pin, 2);
        bool open_drain = (otyper & bit) != 0;
        bool latch_high = (odr & bit) != 0;
        bool level;

        if (mode == 1 && (!open_drain || !latch_high)) {
            level = latch_high;
        } else if (s->external_driven & bit) {
            level = (s->external_level & bit) != 0;
        } else {
            level = pull == 1;
        }

        if (level) {
            resolved |= bit;
        }
    }

    return resolved;
}

static void stm32g474_gpio_resolve(Stm32g474GpioState *s, bool force)
{
    uint16_t old = s->resolved_cache;
    uint16_t resolved = stm32g474_gpio_resolved_value(s);
    uint16_t changed = old ^ resolved;

    s->regs[R_IDR] = resolved;
    if (force || !s->resolved_cache_valid) {
        changed = STM32G474_GPIO_PIN_MASK;
    }

    s->resolved_cache = resolved;
    s->resolved_cache_valid = true;
    for (unsigned int pin = 0; pin < STM32G474_GPIO_NUM_PINS; pin++) {
        if (changed & BIT(pin)) {
            qemu_set_irq(s->pin_out[pin], (resolved & BIT(pin)) != 0);
        }
    }
}

static uint32_t stm32g474_gpio_expand_locked_mask(uint16_t pins,
                                                  unsigned int width,
                                                  unsigned int first_pin,
                                                  unsigned int num_pins)
{
    uint32_t mask = 0;

    for (unsigned int pin = first_pin; pin < first_pin + num_pins; pin++) {
        if (pins & BIT(pin)) {
            mask |= MAKE_64BIT_MASK(width * (pin - first_pin), width);
        }
    }

    return mask;
}

static uint64_t stm32g474_gpio_config_pre_write(RegisterInfo *reg,
                                                 uint64_t val,
                                                 uint32_t locked_fields)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t old = *(uint32_t *)reg->data;

    if (stm32g474_gpio_in_reset(s)) {
        return old;
    }

    return (val & ~locked_fields) | (old & locked_fields);
}

static uint64_t stm32g474_gpio_moder_pre_write(RegisterInfo *reg,
                                                uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t mask = stm32g474_gpio_expand_locked_mask(
        s->locked_mask, 2, 0, STM32G474_GPIO_NUM_PINS);

    return stm32g474_gpio_config_pre_write(reg, val, mask);
}

static uint64_t stm32g474_gpio_otyper_pre_write(RegisterInfo *reg,
                                                 uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);

    return stm32g474_gpio_config_pre_write(reg, val, s->locked_mask);
}

static uint64_t stm32g474_gpio_ospeedr_pre_write(RegisterInfo *reg,
                                                  uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t mask = stm32g474_gpio_expand_locked_mask(
        s->locked_mask, 2, 0, STM32G474_GPIO_NUM_PINS);

    return stm32g474_gpio_config_pre_write(reg, val, mask);
}

static uint64_t stm32g474_gpio_pupdr_pre_write(RegisterInfo *reg,
                                                uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t old = *(uint32_t *)reg->data;
    uint32_t mask = stm32g474_gpio_expand_locked_mask(
        s->locked_mask, 2, 0, STM32G474_GPIO_NUM_PINS);
    uint32_t new_val = stm32g474_gpio_config_pre_write(reg, val, mask);

    if (stm32g474_gpio_in_reset(s)) {
        return new_val;
    }

    for (unsigned int pin = 0; pin < STM32G474_GPIO_NUM_PINS; pin++) {
        if (extract32(new_val, 2 * pin, 2) == 3 &&
            extract32(old, 2 * pin, 2) != 3) {
            qemu_log_mask(LOG_GUEST_ERROR,
                          "%s: reserved PUPDR encoding for pin %u\n",
                          object_get_typename(OBJECT(s)), pin);
        }
    }

    return new_val;
}

static uint64_t stm32g474_gpio_odr_pre_write(RegisterInfo *reg,
                                              uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);

    return stm32g474_gpio_in_reset(s) ? *(uint32_t *)reg->data : val;
}

