zevorn/qemu/hw/gpio/stm32g474_gpio.c
static uint64_t stm32g474_gpio_afrl_pre_write(RegisterInfo *reg,
                                               uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t mask = stm32g474_gpio_expand_locked_mask(
        s->locked_mask, 4, 0, STM32G474_GPIO_NUM_PINS / 2);

    return stm32g474_gpio_config_pre_write(reg, val, mask);
}

static uint64_t stm32g474_gpio_afrh_pre_write(RegisterInfo *reg,
                                               uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t mask = stm32g474_gpio_expand_locked_mask(
        s->locked_mask, 4, STM32G474_GPIO_NUM_PINS / 2,
        STM32G474_GPIO_NUM_PINS / 2);

    return stm32g474_gpio_config_pre_write(reg, val, mask);
}

static void stm32g474_gpio_resolve_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);

    if (!stm32g474_gpio_in_reset(s)) {
        stm32g474_gpio_resolve(s, false);
    }
}

static void stm32g474_gpio_bsrr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t command = val;
    uint32_t set_mask = command & R_BSRR_BS_MASK;
    uint32_t reset_mask = FIELD_EX32(command, BSRR, BR);

    s->regs[R_BSRR] = 0;
    if (stm32g474_gpio_in_reset(s)) {
        return;
    }

    s->regs[R_ODR] = ((s->regs[R_ODR] & ~reset_mask) | set_mask) &
                     STM32G474_GPIO_PIN_MASK;
    stm32g474_gpio_resolve(s, false);
}

static void stm32g474_gpio_brr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t command = val & R_BRR_BR_MASK;

    s->regs[R_BRR] = 0;
    if (stm32g474_gpio_in_reset(s)) {
        return;
    }

    s->regs[R_ODR] &= ~command;
    stm32g474_gpio_resolve(s, false);
}

static uint32_t stm32g474_gpio_lckr_image(Stm32g474GpioState *s)
{
    switch (s->lock_phase) {
    case STM32G474_GPIO_LOCK_HAVE_KEY1:
    case STM32G474_GPIO_LOCK_ARMED_FOR_READ:
        return s->lock_candidate | R_LCKR_LCKK_MASK;
    case STM32G474_GPIO_LOCK_HAVE_KEY0:
        return s->lock_candidate;
    case STM32G474_GPIO_LOCK_LOCKED:
        return s->locked_mask | R_LCKR_LCKK_MASK;
    case STM32G474_GPIO_LOCK_IDLE:
    default:
        return s->regs[R_LCKR] & R_LCKR_LCK_MASK;
    }
}

static uint32_t stm32g474_gpio_lckr_abort(Stm32g474GpioState *s,
                                          uint16_t last_mask)
{
    s->lock_phase = STM32G474_GPIO_LOCK_IDLE;
    s->lock_candidate = 0;
    s->locked_mask = 0;
    s->regs[R_LCKR] = last_mask;
    return last_mask;
}

static bool stm32g474_gpio_is_word_access(Stm32g474GpioState *s)
{
    return s->current_access_size == sizeof(uint32_t) &&
           s->current_access_lane == 0;
}

static uint64_t stm32g474_gpio_lckr_pre_write(RegisterInfo *reg,
                                               uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t old = *(uint32_t *)reg->data;
    uint16_t mask = val & R_LCKR_LCK_MASK;
    bool key = (val & R_LCKR_LCKK_MASK) != 0;

    if (stm32g474_gpio_in_reset(s)) {
        return old;
    }
    if (s->lock_phase == STM32G474_GPIO_LOCK_LOCKED) {
        return s->locked_mask | R_LCKR_LCKK_MASK;
    }
    if (!stm32g474_gpio_is_word_access(s)) {
        return stm32g474_gpio_lckr_abort(s, old & R_LCKR_LCK_MASK);
    }

    switch (s->lock_phase) {
    case STM32G474_GPIO_LOCK_IDLE:
        if (key) {
            s->lock_candidate = mask;
            s->lock_phase = STM32G474_GPIO_LOCK_HAVE_KEY1;
            return mask | R_LCKR_LCKK_MASK;
        }
        break;
    case STM32G474_GPIO_LOCK_HAVE_KEY1:
        if (!key && mask == s->lock_candidate) {
            s->lock_phase = STM32G474_GPIO_LOCK_HAVE_KEY0;
            return mask;
        }
        break;
    case STM32G474_GPIO_LOCK_HAVE_KEY0:
        if (key && mask == s->lock_candidate) {
            s->lock_phase = STM32G474_GPIO_LOCK_ARMED_FOR_READ;
            return mask | R_LCKR_LCKK_MASK;
        }
        break;
    case STM32G474_GPIO_LOCK_ARMED_FOR_READ:
        break;
    default:
        g_assert_not_reached();
    }

    return stm32g474_gpio_lckr_abort(s, mask);
}

static uint64_t stm32g474_gpio_lckr_post_read(RegisterInfo *reg, uint64_t val)
{
    Stm32g474GpioState *s = STM32G474_GPIO(reg->opaque);
    uint32_t access_mask = stm32g474_gpio_access_mask(s);
    uint32_t image;

    if (s->lock_phase == STM32G474_GPIO_LOCK_LOCKED) {
        image = s->locked_mask | R_LCKR_LCKK_MASK;
        s->regs[R_LCKR] = image;
        return image & access_mask;
    }

    if (s->lock_phase == STM32G474_GPIO_LOCK_ARMED_FOR_READ &&
        stm32g474_gpio_is_word_access(s)) {
        s->locked_mask = s->lock_candidate;
        s->lock_phase = STM32G474_GPIO_LOCK_LOCKED;
        image = s->locked_mask | R_LCKR_LCKK_MASK;
        s->regs[R_LCKR] = image;
        return image;
    }

    if (s->lock_phase != STM32G474_GPIO_LOCK_IDLE) {
        image = stm32g474_gpio_lckr_abort(
            s, s->regs[R_LCKR] & R_LCKR_LCK_MASK);
        return image & access_mask;
    }

    return val;
}

static const RegisterAccessInfo stm32g474_gpio_a_regs_info[] = {
    {
        .name = "MODER",
        .addr = A_MODER,
        .reset = 0xabffffff,
        .pre_write = stm32g474_gpio_moder_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "OTYPER",
        .addr = A_OTYPER,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_gpio_otyper_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "OSPEEDR",
        .addr = A_OSPEEDR,
        .reset = 0x0c000000,
        .pre_write = stm32g474_gpio_ospeedr_pre_write,
    }, {
        .name = "PUPDR",
        .addr = A_PUPDR,
        .reset = 0x64000000,
        .pre_write = stm32g474_gpio_pupdr_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "IDR",
        .addr = A_IDR,
        .ro = 0x0000ffff,
        .rsvd = 0xffff0000,
    }, {
        .name = "ODR",
        .addr = A_ODR,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_gpio_odr_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "BSRR",
        .addr = A_BSRR,
        .post_write = stm32g474_gpio_bsrr_post_write,
    }, {
        .name = "LCKR",
        .addr = A_LCKR,
        .rsvd = 0xfffe0000,
        .pre_write = stm32g474_gpio_lckr_pre_write,
        .post_read = stm32g474_gpio_lckr_post_read,
    }, {
        .name = "AFRL",
        .addr = A_AFRL,
        .pre_write = stm32g474_gpio_afrl_pre_write,
    }, {
        .name = "AFRH",
        .addr = A_AFRH,
        .pre_write = stm32g474_gpio_afrh_pre_write,
    }, {
        .name = "BRR",
        .addr = A_BRR,
        .rsvd = 0xffff0000,
        .post_write = stm32g474_gpio_brr_post_write,
    },
};

