zevorn/qemu/hw/gpio/stm32g474_gpio.c
static const RegisterAccessInfo stm32g474_gpio_b_regs_info[] = {
    {
        .name = "MODER",
        .addr = A_MODER,
        .reset = 0xfffffebf,
        .pre_write = stm32g474_gpio_moder_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "OTYPER",
        .addr = A_OTYPER,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_gpio_otyper_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "OSPEEDR",
        .addr = A_OSPEEDR,
        .pre_write = stm32g474_gpio_ospeedr_pre_write,
    }, {
        .name = "PUPDR",
        .addr = A_PUPDR,
        .reset = 0x00000100,
        .pre_write = stm32g474_gpio_pupdr_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "IDR",
        .addr = A_IDR,
        .ro = 0x0000ffff,
        .rsvd = 0xffff0000,
    }, {
        .name = "ODR",
        .addr = A_ODR,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_gpio_odr_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "BSRR",
        .addr = A_BSRR,
        .post_write = stm32g474_gpio_bsrr_post_write,
    }, {
        .name = "LCKR",
        .addr = A_LCKR,
        .rsvd = 0xfffe0000,
        .pre_write = stm32g474_gpio_lckr_pre_write,
        .post_read = stm32g474_gpio_lckr_post_read,
    }, {
        .name = "AFRL",
        .addr = A_AFRL,
        .pre_write = stm32g474_gpio_afrl_pre_write,
    }, {
        .name = "AFRH",
        .addr = A_AFRH,
        .pre_write = stm32g474_gpio_afrh_pre_write,
    }, {
        .name = "BRR",
        .addr = A_BRR,
        .rsvd = 0xffff0000,
        .post_write = stm32g474_gpio_brr_post_write,
    },
};

static const RegisterAccessInfo stm32g474_gpio_cg_regs_info[] = {
    {
        .name = "MODER",
        .addr = A_MODER,
        .reset = 0xffffffff,
        .pre_write = stm32g474_gpio_moder_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "OTYPER",
        .addr = A_OTYPER,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_gpio_otyper_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "OSPEEDR",
        .addr = A_OSPEEDR,
        .pre_write = stm32g474_gpio_ospeedr_pre_write,
    }, {
        .name = "PUPDR",
        .addr = A_PUPDR,
        .pre_write = stm32g474_gpio_pupdr_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "IDR",
        .addr = A_IDR,
        .ro = 0x0000ffff,
        .rsvd = 0xffff0000,
    }, {
        .name = "ODR",
        .addr = A_ODR,
        .rsvd = 0xffff0000,
        .pre_write = stm32g474_gpio_odr_pre_write,
        .post_write = stm32g474_gpio_resolve_post_write,
    }, {
        .name = "BSRR",
        .addr = A_BSRR,
        .post_write = stm32g474_gpio_bsrr_post_write,
    }, {
        .name = "LCKR",
        .addr = A_LCKR,
        .rsvd = 0xfffe0000,
        .pre_write = stm32g474_gpio_lckr_pre_write,
        .post_read = stm32g474_gpio_lckr_post_read,
    }, {
        .name = "AFRL",
        .addr = A_AFRL,
        .pre_write = stm32g474_gpio_afrl_pre_write,
    }, {
        .name = "AFRH",
        .addr = A_AFRH,
        .pre_write = stm32g474_gpio_afrh_pre_write,
    }, {
        .name = "BRR",
        .addr = A_BRR,
        .rsvd = 0xffff0000,
        .post_write = stm32g474_gpio_brr_post_write,
    },
};

static const Stm32g474GpioVariant stm32g474_gpio_a_variant = {
    .name = "GPIOA",
    .regs_info = stm32g474_gpio_a_regs_info,
    .num_regs = ARRAY_SIZE(stm32g474_gpio_a_regs_info),
};

static const Stm32g474GpioVariant stm32g474_gpio_b_variant = {
    .name = "GPIOB",
    .regs_info = stm32g474_gpio_b_regs_info,
    .num_regs = ARRAY_SIZE(stm32g474_gpio_b_regs_info),
};

static const Stm32g474GpioVariant stm32g474_gpio_cg_variant = {
    .name = "GPIOC-G",
    .regs_info = stm32g474_gpio_cg_regs_info,
    .num_regs = ARRAY_SIZE(stm32g474_gpio_cg_regs_info),
};

G_STATIC_ASSERT(STM32G474_GPIO_NUM_REGS ==
                A_BRR / sizeof(uint32_t) + 1);

static RegisterInfo *stm32g474_gpio_find_register(RegisterInfoArray *reg_array,
                                                  hwaddr addr)
{
    for (int i = 0; i < reg_array->num_elements; i++) {
        if (reg_array->r[i]->access->addr == addr) {
            return reg_array->r[i];
        }
    }

    return NULL;
}

static bool stm32g474_gpio_valid_access(RegisterInfoArray *reg_array,
                                         hwaddr addr, unsigned int size)
{
    if ((size != 1 && size != 2 && size != 4) ||
        (addr & (size - 1)) != 0 || (addr & 3) + size > sizeof(uint32_t)) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: invalid access at address 0x%" HWADDR_PRIx
                      " of size %u\n", reg_array->prefix, addr, size);
        return false;
    }

    return true;
}

static uint64_t stm32g474_gpio_read(void *opaque, hwaddr addr,
                                     unsigned int size)
{
    RegisterInfoArray *reg_array = opaque;
    Stm32g474GpioState *s =
        STM32G474_GPIO(register_array_get_owner(reg_array));
    hwaddr reg_addr = addr & ~(hwaddr)3;
    RegisterInfo *reg;
    unsigned int lane;
    unsigned int shift;
    uint64_t re;
    uint64_t value;

    if (!stm32g474_gpio_valid_access(reg_array, addr, size)) {
        return 0;
    }

    reg = stm32g474_gpio_find_register(reg_array, reg_addr);
    if (!reg) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: read from unimplemented register at address 0x%"
                      HWADDR_PRIx "\n", reg_array->prefix, addr);
        return 0;
    }

    lane = addr & 3;
    shift = 8 * lane;
    re = MAKE_64BIT_MASK(shift, size * 8);
    s->current_access_size = size;
    s->current_access_lane = lane;
    value = register_read(reg, re, reg_array->prefix, reg_array->debug);
    s->current_access_size = 0;
    s->current_access_lane = 0;

    return (value >> shift) & MAKE_64BIT_MASK(0, size * 8);
}

static void stm32g474_gpio_write(void *opaque, hwaddr addr, uint64_t value,
                                  unsigned int size)
{
    RegisterInfoArray *reg_array = opaque;
    Stm32g474GpioState *s =
        STM32G474_GPIO(register_array_get_owner(reg_array));
    hwaddr reg_addr = addr & ~(hwaddr)3;
    RegisterInfo *reg;
    unsigned int lane;
    unsigned int shift;
    uint64_t we;
    uint64_t lane_value;

    if (!stm32g474_gpio_valid_access(reg_array, addr, size)) {
        return;
    }

    reg = stm32g474_gpio_find_register(reg_array, reg_addr);
    if (!reg) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: write to unimplemented register at address 0x%"
                      HWADDR_PRIx "\n", reg_array->prefix, addr);
        return;
    }

    lane = addr & 3;
    shift = 8 * lane;
    we = MAKE_64BIT_MASK(shift, size * 8);
    lane_value = (value & MAKE_64BIT_MASK(0, size * 8)) << shift;
    s->current_access_size = size;
    s->current_access_lane = lane;
    register_write(reg, lane_value, we, reg_array->prefix,
                   reg_array->debug);
    s->current_access_size = 0;
    s->current_access_lane = 0;
}

static const MemoryRegionOps stm32g474_gpio_ops = {
    .read = stm32g474_gpio_read,
    .write = stm32g474_gpio_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = false,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static void stm32g474_gpio_reset_registers(Stm32g474GpioState *s)
{
    bool was_resetting = s->resetting;

