zevorn/qemu/hw/gpio/stm32g474_gpio.c
    s->resetting = true;
    for (int i = 0; i < s->reg_array->num_elements; i++) {
        register_reset(s->reg_array->r[i]);
    }
    s->regs[R_BSRR] = 0;
    s->regs[R_BRR] = 0;
    s->lock_phase = STM32G474_GPIO_LOCK_IDLE;
    s->lock_candidate = 0;
    s->locked_mask = 0;
    s->current_access_size = 0;
    s->current_access_lane = 0;
    s->resetting = was_resetting;
    s->resolved_cache_valid = false;
}

static void stm32g474_gpio_reset_input(void *opaque, int n, int level)
{
    Stm32g474GpioState *s = STM32G474_GPIO(opaque);
    bool asserted = level != 0;

    if (asserted == s->peripheral_reset_asserted) {
        return;
    }

    s->peripheral_reset_asserted = asserted;
    if (asserted) {
        stm32g474_gpio_reset_registers(s);
        stm32g474_gpio_resolve(s, true);
    }
}

static void stm32g474_gpio_pin_input(void *opaque, int n, int level)
{
    Stm32g474GpioState *s = STM32G474_GPIO(opaque);
    uint16_t bit = BIT(n);

    if (level < 0) {
        if (!(s->external_driven & bit)) {
            return;
        }
        s->external_driven &= ~bit;
    } else {
        bool was_driven = (s->external_driven & bit) != 0;
        bool was_high = (s->external_level & bit) != 0;
        bool high = level > 0;

        if (was_driven && was_high == high) {
            return;
        }
        s->external_driven |= bit;
        if (high) {
            s->external_level |= bit;
        } else {
            s->external_level &= ~bit;
        }
    }

    stm32g474_gpio_resolve(s, false);
}

static void stm32g474_gpio_reset_enter(Object *obj, ResetType type)
{
    Stm32g474GpioState *s = STM32G474_GPIO(obj);

    s->resetting = true;
}

static void stm32g474_gpio_reset_hold(Object *obj, ResetType type)
{
    Stm32g474GpioState *s = STM32G474_GPIO(obj);

    stm32g474_gpio_reset_registers(s);
    s->peripheral_reset_asserted = false;
}

static void stm32g474_gpio_reset_exit(Object *obj, ResetType type)
{
    Stm32g474GpioState *s = STM32G474_GPIO(obj);

    s->resetting = false;
    s->resolved_cache_valid = false;
    stm32g474_gpio_resolve(s, true);
}

static bool stm32g474_gpio_valid_lock_state(Stm32g474GpioState *s)
{
    switch (s->lock_phase) {
    case STM32G474_GPIO_LOCK_IDLE:
        return s->lock_candidate == 0 && s->locked_mask == 0;
    case STM32G474_GPIO_LOCK_HAVE_KEY1:
    case STM32G474_GPIO_LOCK_HAVE_KEY0:
    case STM32G474_GPIO_LOCK_ARMED_FOR_READ:
        return s->locked_mask == 0;
    case STM32G474_GPIO_LOCK_LOCKED:
        return s->lock_candidate == s->locked_mask;
    default:
        return false;
    }
}

static int stm32g474_gpio_post_load(void *opaque, int version_id)
{
    Stm32g474GpioState *s = STM32G474_GPIO(opaque);
    const Stm32g474GpioVariant *variant = stm32g474_gpio_get_variant(s);

    s->resetting = false;
    s->current_access_size = 0;
    s->current_access_lane = 0;
    if (!stm32g474_gpio_valid_lock_state(s)) {
        return -EINVAL;
    }

    for (size_t i = 0; i < variant->num_regs; i++) {
        const RegisterAccessInfo *access = &variant->regs_info[i];
        unsigned int index = access->addr / sizeof(uint32_t);

        s->regs[index] = (s->regs[index] & ~access->rsvd) |
                         (access->reset & access->rsvd);
    }

    s->external_driven &= STM32G474_GPIO_PIN_MASK;
    s->external_level &= STM32G474_GPIO_PIN_MASK;
    s->lock_candidate &= STM32G474_GPIO_PIN_MASK;
    s->locked_mask &= STM32G474_GPIO_PIN_MASK;
    s->regs[R_BSRR] = 0;
    s->regs[R_BRR] = 0;
    s->regs[R_LCKR] = stm32g474_gpio_lckr_image(s);

    if (s->peripheral_reset_asserted) {
        stm32g474_gpio_reset_registers(s);
    }

    s->resolved_cache_valid = false;
    stm32g474_gpio_resolve(s, true);
    return 0;
}

static const VMStateDescription vmstate_stm32g474_gpio = {
    .name = TYPE_STM32G474_GPIO,
    .version_id = 1,
    .minimum_version_id = 1,
    .post_load = stm32g474_gpio_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, Stm32g474GpioState,
                             STM32G474_GPIO_NUM_REGS),
        VMSTATE_UINT16(external_driven, Stm32g474GpioState),
        VMSTATE_UINT16(external_level, Stm32g474GpioState),
        VMSTATE_UINT16(lock_candidate, Stm32g474GpioState),
        VMSTATE_UINT16(locked_mask, Stm32g474GpioState),
        VMSTATE_UINT8(lock_phase, Stm32g474GpioState),
        VMSTATE_BOOL(peripheral_reset_asserted, Stm32g474GpioState),
        VMSTATE_CLOCK(clk, Stm32g474GpioState),
        VMSTATE_END_OF_LIST()
    },
};

static void stm32g474_gpio_realize(DeviceState *dev, Error **errp)
{
    Stm32g474GpioState *s = STM32G474_GPIO(dev);
    const Stm32g474GpioVariant *variant = stm32g474_gpio_get_variant(s);

    if (!variant || !s->reg_array) {
        error_setg(errp, TYPE_STM32G474_GPIO
                   ": concrete variant is missing");
        return;
    }
    if (!clock_has_source(s->clk)) {
        error_setg(errp, TYPE_STM32G474_GPIO
                   ": clk clock must be connected");
        return;
    }
}

static void stm32g474_gpio_init(Object *obj)
{
    Stm32g474GpioState *s = STM32G474_GPIO(obj);
    Stm32g474GpioClass *gc = STM32G474_GPIO_GET_CLASS(obj);
    DeviceState *dev = DEVICE(obj);

    g_assert(gc->variant);
    g_assert(gc->variant->num_regs <= STM32G474_GPIO_NUM_REGS);

    s->reg_array = register_init_block32(
        dev, gc->variant->regs_info, gc->variant->num_regs,
        s->regs_info, s->regs, &stm32g474_gpio_ops, false,
        STM32G474_GPIO_MMIO_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->reg_array->mem);
    s->clk = qdev_init_clock_in(dev, "clk", NULL, NULL, 0);
    qdev_init_gpio_in_named(dev, stm32g474_gpio_reset_input, "reset", 1);
    qdev_init_gpio_in_named(dev, stm32g474_gpio_pin_input, "pin-in",
                            STM32G474_GPIO_NUM_PINS);
    qdev_init_gpio_out_named(dev, s->pin_out, "pin-out",
                             STM32G474_GPIO_NUM_PINS);
}

static void stm32g474_gpio_base_class_init(ObjectClass *klass,
                                            const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = stm32g474_gpio_realize;
    dc->vmsd = &vmstate_stm32g474_gpio;
    dc->user_creatable = false;
    rc->phases.enter = stm32g474_gpio_reset_enter;
    rc->phases.hold = stm32g474_gpio_reset_hold;
    rc->phases.exit = stm32g474_gpio_reset_exit;
}

static void stm32g474_gpio_a_class_init(ObjectClass *klass, const void *data)
{
    Stm32g474GpioClass *gc = STM32G474_GPIO_CLASS(klass);

    gc->variant = &stm32g474_gpio_a_variant;
}

static void stm32g474_gpio_b_class_init(ObjectClass *klass, const void *data)
{
    Stm32g474GpioClass *gc = STM32G474_GPIO_CLASS(klass);

    gc->variant = &stm32g474_gpio_b_variant;
}

static void stm32g474_gpio_cg_class_init(ObjectClass *klass, const void *data)
{
    Stm32g474GpioClass *gc = STM32G474_GPIO_CLASS(klass);

    gc->variant = &stm32g474_gpio_cg_variant;
}

static const TypeInfo stm32g474_gpio_types[] = {
    {
        .name = TYPE_STM32G474_GPIO,
        .parent = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(Stm32g474GpioState),
        .class_size = sizeof(Stm32g474GpioClass),
        .instance_init = stm32g474_gpio_init,
        .class_init = stm32g474_gpio_base_class_init,
        .abstract = true,
    }, {
        .name = TYPE_STM32G474_GPIO_A,
        .parent = TYPE_STM32G474_GPIO,
        .class_init = stm32g474_gpio_a_class_init,
    }, {
        .name = TYPE_STM32G474_GPIO_B,
        .parent = TYPE_STM32G474_GPIO,
        .class_init = stm32g474_gpio_b_class_init,
    }, {
        .name = TYPE_STM32G474_GPIO_CG,
        .parent = TYPE_STM32G474_GPIO,
        .class_init = stm32g474_gpio_cg_class_init,
    },
};

DEFINE_TYPES(stm32g474_gpio_types)
